function pr = get_pr_from_f(ma)
switch ma.percept.f_curr
    case 1
        % 我方期望队形（半径2km菱形编队）
        pr = [2,0,-2,0;0,2,0,-2];
    case 2
        % 我方期望队形（间距2km横一字型编队）
        pr = [3,-1,-3,1;0,0,0,0];
    case 3
        % 我方期望队形（间距2km竖一字型编队）
        pr = [0,0,0,0;1,3,-1,-3];
    case 4
        % 我方期望队形（间距2km平行四边形(梯)编队）
        pr = [2,-1,-2,1;0,2,0,-2];
    case 5
        % 我方期望队形（间距2km梯型编队）
        pr = [2,-1,-2,1;-1,1,-1,1];
    case 6
        % 我方期望队形（间距2km平行四边形(楔)编队）
        pr = [1.5,-0.5,-1.5,0.5;1,1,-1,-1];
    case 7
        % 我方期望队形（间距2km左楔形编队）
        pr = [1.5,-0.5,-1.5,0.5;-2,2,0,0];
    case 8
        % 我方期望队形（间距2km右楔形编队）
        pr = [1.5,-0.5,-1.5,0.5;0,0,-2,2];
    otherwise
        % 我方期望队形（半径2km正方形编队）
        pr = [2,-2,-2,2;2,2,-2,-2];
end
pr = pr/2*ma.percept.f_scale;
end